# Homebrew Bundle - Phase 1 CLI Tools
#
# Install with: brew bundle install --file=config/Brewfile

# Version control
brew "git"              # Distributed version control system
brew "git-filter-repo"  # History rewriting / repo scrubbing (binary: git-filter-repo)

# Node.js ecosystem (npm is bundled with node)
brew "node"             # JavaScript runtime (includes npm)
brew "yarn"             # Fast, reliable dependency management
brew "pnpm"             # Fast, disk space efficient package manager
brew "fnm"              # Fast Node Manager - Rust-based version manager

# GitHub CLI
brew "gh"               # GitHub command-line tool

# Go (builds the hey CLI from source — see scripts/install-hey.sh)
brew "go"               # Go toolchain; GOTOOLCHAIN=auto fetches newer per go.mod

# Mac App Store CLI (the MAS apps themselves live in config/Brewfile.mas — needs App Store sign-in)
brew "mas"              # install/manage Mac App Store apps from the CLI

# AI Tools
brew "opencode"         # AI coding agent for the terminal

# File utilities
brew "tree"             # Display directory structure
brew "jq"               # JSON processor for state file management

# Modern CLI ergonomics
brew "atuin"            # Searchable, syncable shell history (ctrl-R upgrade)
brew "zoxide"           # Smarter cd that learns your dirs (z <partial>)
brew "eza"              # Modern ls — icons, git-aware, tree
brew "bat"              # cat with syntax highlighting + git integration
brew "fzf"              # Fuzzy finder — wires into zsh + zoxide + atuin
brew "ripgrep"          # Fast recursive grep (rg)
brew "git-delta"        # Beautiful git diffs (binary: delta)

# Shell prompt
brew "starship"         # Cross-shell prompt with minimal, powerful configuration

# CLI interface framework
brew "gum"              # Tool for beautiful shell scripts

# Dotfiles management
brew "stow"             # Symlink farm manager

# Window manager (the `aerospace` cask is in Brewfile.apps; the tap must live
# here because install-apps.sh ignores tap lines — only the main Brewfile runs them)
tap "nikitabobko/tap"

# Media & image tooling
tap "charmbracelet/tap"
brew "ffmpeg"                    # Audio/video transcoding
brew "imagemagick"              # Image manipulation
brew "poppler"                  # PDF utilities (pdftoppm, etc.)
brew "charmbracelet/tap/freeze" # Screenshots of code/terminal output
